app/controllers/tasks_controller.rb

  def create
    Task.create(task_create_params)
---
INSERT INTO "tasks" ("name", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "ddd"], ["description", "sa"], ["created_at", "2017-11-27 07:50:59.338957"], ["updated_at", "2017-11-27 07:50:59.338957"]]

  def edit
    @task = Task.find_by(id: params[:id])
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    task = Task.find_by(id: params[:id])
    if task && params[:task]
      task.update!(task_update_params)
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["description", "Test1"], ["updated_at", "2017-11-28 22:34:26.252994"], ["id", 1]]

    task = Task.find_by(id: params[:id])
    if task
      task.destroy!
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 2]]